{
  "project": "AudienceSafe",
  "branchName": "ralph/ui-improvements",
  "description": "Frontend UI Improvements - Fix visual inconsistencies, improve UX, fix Stripe redirects, replace sync history with subscriber table, fix dark theme issues, improve list management, and ensure sync respects selected lists",
  "userStories": [
    {
      "id": "US-001",
      "title": "Fix List Selector Checkbox Styling",
      "description": "As a user, I want checkboxes in the list selector to look like checkboxes when selected, not like buttons, so the UI is more intuitive.",
      "acceptanceCriteria": [
        "Selected checkboxes in ListSelector component maintain checkbox appearance (not button-like)",
        "Checkbox styling is consistent with unselected state but clearly indicates selection",
        "Visual feedback is clear and follows design system patterns",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 1,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-002",
      "title": "Fix Stripe Success/Cancel URLs",
      "description": "As a developer, I want Stripe checkout success and cancel URLs to use the configured frontend URL instead of hardcoded localhost, so redirects work correctly in all environments.",
      "acceptanceCriteria": [
        "Backend uses FRONTEND_URL or NEXT_PUBLIC_URL environment variable for success URL",
        "Backend uses FRONTEND_URL or NEXT_PUBLIC_URL environment variable for cancel URL",
        "Fallback to current URL origin if environment variable not set",
        "Success URL: {FRONTEND_URL}/onboarding/success?session_id={CHECKOUT_SESSION_ID}",
        "Cancel URL: {FRONTEND_URL}/onboarding/stripe?canceled=true",
        "Works correctly in development, staging, and production",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-003",
      "title": "Fix Sync to Only Process Selected Lists",
      "description": "As a user, I want sync operations to only process selected lists, not all available lists, so I have control over what data is synced.",
      "acceptanceCriteria": [
        "Backend sync service only syncs lists in publicationIds array",
        "If no lists are selected (publicationIds is empty/null), sync shows 'No lists selected' message",
        "Sync operation validates that selected lists exist before processing",
        "Frontend displays appropriate message when triggering sync with no selected lists",
        "Sync history reflects which lists were synced",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 3,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-004",
      "title": "Add Backend Endpoint for Connection-Wide Subscriber Statistics",
      "description": "As a developer, I need a backend endpoint that provides connection-wide subscriber statistics so the frontend can display accurate breakdown data.",
      "acceptanceCriteria": [
        "Add GET endpoint: /esp-connections/:id/subscriber-stats",
        "Endpoint returns active count, unsubscribed count, and total count for entire connection",
        "Endpoint requires authentication",
        "Endpoint returns 404 if connection not found",
        "Statistics calculated from all subscribers in connection, not paginated subset",
        "Typecheck passes"
      ],
      "priority": 4,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-005",
      "title": "Fix Subscriber Breakdown to Show Connection-Wide Stats",
      "description": "As a user, I want the subscriber breakdown card to show statistics for the entire connection, not just the current page, so I get accurate overview information.",
      "acceptanceCriteria": [
        "Subscriber breakdown card fetches connection-wide statistics from new API endpoint",
        "Breakdown displays active/unsubscribed counts from all subscribers in connection",
        "Breakdown uses total connection subscriber count, not paginated data",
        "Breakdown updates when sync completes",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 5,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-006",
      "title": "Add Skip Button to Onboarding Final Step",
      "description": "As a user, I want to skip the final onboarding step (Stripe payment) so I can finish onboarding without syncing lists immediately.",
      "acceptanceCriteria": [
        "Add secondary 'Skip' button to /onboarding/stripe page",
        "Skip button is visually distinct from primary 'Connect Stripe' button",
        "Clicking Skip completes onboarding without triggering sync",
        "User is redirected to dashboard after skipping",
        "Onboarding completion status is properly set",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 6,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-007",
      "title": "Fix Loading Skeletons for Dark Theme",
      "description": "As a user, I want loading skeletons to look good in dark theme, so the UI is visually consistent.",
      "acceptanceCriteria": [
        "Loading skeletons in connection page use dark theme-appropriate colors",
        "Skeleton colors are visible but not too bright in dark mode",
        "Skeleton styling adapts to theme (light/dark)",
        "All skeleton states in connection detail page are updated",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 7,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-008",
      "title": "Fix Select Lists Modal Dark Theme",
      "description": "As a user, I want the Select Lists modal to match the dark theme, so the UI is visually consistent.",
      "acceptanceCriteria": [
        "Manage Lists dialog uses dark theme styling",
        "Dialog background, text, and borders are dark theme-appropriate",
        "ListSelector component within dialog respects dark theme",
        "All interactive elements are visible and accessible in dark mode",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 8,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-009",
      "title": "Change List Selection to Save on Modal Action Only",
      "description": "As a user, I want list selection changes to only save when I click the primary action button, so I have control over when changes are applied.",
      "acceptanceCriteria": [
        "Remove auto-save behavior from ListSelector when used in Manage Lists dialog",
        "Remove success alert that appears when selecting/deselecting items",
        "Add 'Save' button as primary action in Manage Lists dialog footer",
        "Add 'Cancel' button as secondary action in Manage Lists dialog footer",
        "Changes are only saved when 'Save' button is clicked",
        "Success toast notification appears after successful save",
        "Dialog closes after successful save",
        "Cancel button discards changes and closes dialog",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 9,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-010",
      "title": "Move Selected Lists to Sidebar Submenu",
      "description": "As a user, I want to access Selected Lists management and connection actions from a sidebar submenu, so the connection page is less cluttered.",
      "acceptanceCriteria": [
        "Remove 'Selected Lists' card from connection detail page",
        "Add three-dot menu icon to connection item in sidebar",
        "Submenu appears on hover/click of three-dot icon",
        "Submenu contains: 'Manage Lists' and 'Delete Connection' options",
        "'Manage Lists' opens the existing Manage Lists dialog",
        "'Delete Connection' opens delete confirmation dialog",
        "Submenu works in both desktop and mobile sidebar",
        "Selected lists count is still visible in sidebar connection item",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 10,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-011",
      "title": "Replace Dashboard Sync History with All Subscribers Table",
      "description": "As a user, I want to see all subscribers from all connections in the dashboard instead of sync history, so I have a unified view of my subscriber data.",
      "acceptanceCriteria": [
        "Remove sync history table from dashboard (/dashboard)",
        "Add 'All Subscribers' table showing subscribers from all connections",
        "Table includes columns: Email, First Name, Last Name, Status, Subscribed At, Connection (ESP name)",
        "Table supports pagination (50 items per page by default)",
        "Table shows empty state when no subscribers exist",
        "Connection column displays ESP name (e.g., 'Mailchimp', 'Kit')",
        "Table styling matches existing subscriber table in connection detail page",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 11,
      "passes": false,
      "notes": ""
    }
  ]
}
